{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_nn_max_pool2d"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_reshape_transpose", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_reshape_transpose"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_multiply_round_clip", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_multiply_round_clip"
      }, 
      "inputs": [
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_cast_14"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_cast_15"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_3"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_3"
      }, 
      "inputs": [
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_3"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_add_nn_relu_clip_cast_copy", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_add_nn_relu_clip_cast_copy"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_1"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_33", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_3"
      }, 
      "inputs": [
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_31", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_3"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_32", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_3"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy_3"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_2"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_2"
      }, 
      "inputs": [
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_2"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_22", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_2"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_4"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_2"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy_21", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy_2"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_3"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_24", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_2"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_41", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_4"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_23", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_2"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy_2"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_1"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_1"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_4"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_1"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_5"
      }, 
      "inputs": [
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_1"
      }, 
      "inputs": [
        [
          59, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy_1"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_5"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_1"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_51", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_5"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy_1"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy_1"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_6"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy"
      }, 
      "inputs": [
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_6"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_clip_cast_copy", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_clip_cast_copy"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ], 
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_nn_relu_add_right_shift_clip_cast_7"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_conv2d_add_add_right_shift_clip_cast_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_conv2d_add_add_right_shift_clip_cast_7"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_copy3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_copy"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_cast_add_nn_relu_cast_copy", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "fused_cast_cast_add_nn_relu_cast_copy"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_cast_transpose_reshape", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_cast_transpose_reshape"
      }, 
      "inputs": [
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_global_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_nn_global_avg_pool2d"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_batch_flatten_cast_multiply", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "fused_nn_batch_flatten_cast_multiply"
      }, 
      "inputs": [
        [
          94, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "fused_nn_dense_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "fused_nn_dense_add"
      }, 
      "inputs": [
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          0
        ], 
        [
          97, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    9, 
    10, 
    13, 
    14, 
    18, 
    19, 
    22, 
    23, 
    27, 
    28, 
    31, 
    32, 
    35, 
    36, 
    40, 
    41, 
    44, 
    45, 
    49, 
    50, 
    53, 
    54, 
    57, 
    58, 
    62, 
    63, 
    66, 
    67, 
    71, 
    72, 
    75, 
    76, 
    79, 
    80, 
    84, 
    85, 
    88, 
    89, 
    96, 
    97
  ], 
  "heads": [
    [
      98, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "int32", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int8", 
        "int8", 
        "int8", 
        "int32", 
        "int32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        3, 
        4, 
        3, 
        5, 
        6, 
        7, 
        4, 
        5, 
        8, 
        9, 
        4, 
        5, 
        4, 
        10, 
        11, 
        5, 
        3, 
        12, 
        13, 
        5, 
        3, 
        5, 
        14, 
        15, 
        4, 
        16, 
        17, 
        18, 
        4, 
        5, 
        19, 
        20, 
        4, 
        5, 
        4, 
        21, 
        22, 
        16, 
        5, 
        23, 
        24, 
        16, 
        5, 
        16, 
        25, 
        26, 
        5, 
        4, 
        27, 
        28, 
        5, 
        16, 
        29, 
        30, 
        5, 
        16, 
        5, 
        31, 
        32, 
        16, 
        4, 
        33, 
        34, 
        16, 
        4, 
        16, 
        35, 
        36, 
        5, 
        37, 
        38, 
        39, 
        5, 
        16, 
        40, 
        41, 
        5, 
        16, 
        5, 
        42, 
        43, 
        37, 
        16, 
        44, 
        45, 
        37, 
        16, 
        37, 
        16, 
        37, 
        46, 
        47, 
        48, 
        37
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 224, 224], 
        [64, 3, 7, 7], 
        [64, 1, 1], 
        [1, 64, 112, 112], 
        [1, 64, 56, 56], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [4, 4, 3, 3, 16, 16], 
        [4, 1, 1, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [4, 4, 3, 3, 16, 16], 
        [4, 1, 1, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [4, 4, 3, 3, 16, 16], 
        [4, 1, 1, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [4, 4, 3, 3, 16, 16], 
        [4, 1, 1, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [1, 4, 56, 56, 1, 16], 
        [8, 4, 1, 1, 16, 16], 
        [8, 1, 1, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [8, 4, 3, 3, 16, 16], 
        [8, 1, 1, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [8, 8, 3, 3, 16, 16], 
        [8, 1, 1, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [8, 8, 3, 3, 16, 16], 
        [8, 1, 1, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [8, 8, 3, 3, 16, 16], 
        [8, 1, 1, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [1, 8, 28, 28, 1, 16], 
        [16, 8, 1, 1, 16, 16], 
        [16, 1, 1, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [16, 8, 3, 3, 16, 16], 
        [16, 1, 1, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [16, 16, 3, 3, 16, 16], 
        [16, 1, 1, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [16, 16, 3, 3, 16, 16], 
        [16, 1, 1, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [16, 16, 3, 3, 16, 16], 
        [16, 1, 1, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [1, 16, 14, 14, 1, 16], 
        [32, 16, 1, 1, 16, 16], 
        [32, 1, 1, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [32, 16, 3, 3, 16, 16], 
        [32, 1, 1, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [32, 32, 3, 3, 16, 16], 
        [32, 1, 1, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [32, 32, 3, 3, 16, 16], 
        [32, 1, 1, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [32, 32, 3, 3, 16, 16], 
        [32, 1, 1, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 32, 7, 7, 1, 16], 
        [1, 512, 7, 7], 
        [1, 512, 1, 1], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99
  ]
}